{
  "basics": {
    "name": "Rose Karon",
    "label": "Senior Product Owner/Manager with multi domain expertise and global experience",
    "picture": "https://avatars1.githubusercontent.com/u/780526?v=3&s=460",
    "email": "rose@karon.se",
    "website": "https://rose.karon.se",
    "summary": "Having amassed more than 15 years of international experience across multiple countries including the Philippines, Singapore, China, and Sweden, I have developed a deep understanding of gathering business requirements and translating them into innovative systems/solutions for intricate industries such as gaming, e-learning, social networking, and marketing automation.\n\nMy unique combination of empathy and passion enables me to seamlessly bridge the divide between business and technology.\n\nI am a fervent advocate of agile methodologies and have excelled in roles as a Product Owner and Scrum Master, leading agile teams to success.",
    "location": {
      "city": "Stockholm",
      "countryCode": "SE"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "rosekaron",
        "url": "https://github.com/rosekaron"
      },
      {
        "network": "LinkedIn",
        "username": "rosekaron",
        "url": "https://linkedin.com/in/rosekaron"
      }
    ]
  },
  "work": [
    {
      "company": "Efficy",
      "position": "Product Owner",
      "website": "https://www.efficy.com/",
      "startDate": "2022-06-01",
      "summary": "Efficy is a dynamic software company specializing in delivering tailor-made CRM solutions that cater to the diverse needs of businesses, regardless of their scale or magnitude.",
      "highlights": [
        "Leading end-to-end delivery of multiple CRM integrations.",
        "Developing impactful marketing automation features reaching millions of customers globally."
      ]
    },
    {
      "company": "Kambi",
      "position": "Product Owner",
      "website": "https://www.kambi.com/",
      "startDate": "2017-08-01",
      "endDate": "2022-05-01",
      "summary": "Kambi stands as a prominent B2B provider, offering top-tier sports betting services exclusively to licensed B2C gaming operators.",
      "highlights": [
        "Led a team of engineers who built and maintained APIs that support famous sportsbook brands, driving business growth.",
        "Orchestrated a successful rollout of a redesigned landing page, enhancing user experience.",
        "Designed and implemented back-office tools for regulatory compliance, ensuring compliance standards."
      ]
    },
    {
      "company": "SchoolApply",
      "position": "Product Manager",
      "website": "https://www.schoolapply.com/",
      "startDate": "2017-07-10",
      "endDate": "2018-05-01",
      "summary": "SchoolApply facilitates global connections between students and educational institutions, enabling students from any corner of the world to discover and connect with schools that align perfectly with their unique needs and potential.",
      "highlights": [
        "Built a proof of concept for a platform for efficient management of school data, optimizing workflows.",
        "Managed a remote team of engineers",
        "Delivered business requirements for an agency system, facilitating smooth operations."
      ]
    },
    {
      "company": "SWK Industries",
      "position": "Co-founder",
      "startDate": "2016-02-01",
      "summary": "SWK Industries is an innovative software development startup that focuses on crafting cutting-edge platforms specifically designed for the event technology industry.",
      "highlights": [
        "Directed a remote engineering team, driving product development in the event tech industry..",
        "Authored business specifications for event tech solutions, enabling seamless platform functionality."
      ]
    },
    {
      "company": "EF Kids and Teens",
      "position": "Technical Project Manager",
      "website": "http://www.ef.com/",
      "startDate": "2015-05-01",
      "endDate": "2015-12-01",
      "summary": "EF, one of the world's largest educational institutions, boasts a global presence with over 42,000 employees spread across 112 countries. Since 1988, EF has forged a partnership with the Olympics committee, delivering language training to selected host countries. Additionally, EF collaborates with the Clinton Foundation to present the Hult Prize, a renowned global competition empowering young social entrepreneurs to tackle worldwide challenges. During my rewarding three and a half years at EF, I had the privilege of hand-picking my projects, which allowed me to contribute to the success of five diverse teams.",
      "highlights": [
        "Built a proof of concept for optimizing the use of AEM as a CMS platform, resulting in cost savings and improved content delivery.",
        "Developed ELK-based monitoring tools, proactively resolving issues and ensuring optimal performance.",
        "Implemented OKRs as a goal-setting tool, fostering organizational alignment and driving success."
      ]
    },
    {
      "company": "EF Learning Labs (Shanghai, China)",
      "position": "Technical Project Manager / Head of PMO",
      "website": "http://www.ef.com/",
      "startDate": "2012-02-01",
      "endDate": "2015-04-30",
      "summary": "EF, a global educational powerhouse, operates on a grand scale with a workforce of over 42,000 professionals spanning across 112 countries. Since 1988, EF has formed a strategic alliance with the Olympics committee, delivering language training to host countries. Additionally, EF collaborates with the Clinton Foundation to present the Hult Prize, a prestigious global competition centered around empowering young social entrepreneurs to devise solutions for pressing global issues. During my tenure at EF, which I consider fortunate, I was granted the exceptional privilege of selecting and contributing to five distinct projects, showcasing my diverse skill set and passion for teamwork.",
      "highlights": [
        "Led a team of engineers in launching the latest version of EF's language learning software to millions of users all over the world, including 1 million staff and volunteers in the Rio 2016 olympics.",
        "Launched EF's language learning software to millions globally, supporting language education initiatives."
      ]
    },
    {
      "company": "MyCube",
      "position": "Product Manager",
      "startDate": "2009-05-01",
      "endDate": "2012-01-15",
      "summary": "MyCube, a revolutionary digital life management tool developed by Swedish entrepreneur Johan Stael von Holstein, offers a seamless platform for content exchange, sharing, and selling. During my tenure at MyCube, I played a pivotal role in delivering the Minimum Viable Product (MVP) on the web platform. Following a successful launch, I transitioned to the role of mobile product manager. Working closely with a UX design consultant, we crafted and delivered the approved wireframes for the mobile product. Additionally, I contributed to the initial design of the MVP for a member service back office before embarking on a new journey in Shanghai.",
      "highlights": [
        "Conceptualized and delivered the initial design of the MyCube mobile platform, empowering users to manage their digital lives.",
        "Documented and delivered the MyCube web platform, providing a seamless user experience for content exchange and sharing.",
        "Designed the MVP version of the member services back office, optimizing operational efficiency for the digital content industry."
      ]
    },
    {
      "company": "Laron Pte. Ltd.",
      "position": "Project Manager",
      "startDate": "2009-01-01",
      "endDate": "2009-05-30",
      "summary": "Laron Pte Ltd. is a distinguished IT consulting firm that specializes in the realm of online gaming. Following my five-month tenure as a contractor at MyCube, an exciting turn of events unfolded as MyCube recognized the immense value in Laron's expertise and made the decision to acquire both the company and its entire team.",
      "highlights": [
        "Implemented documentation standards.",
        "Headed cross-functional teams for an IT consulting company specialized in online gaming."
      ]
    },
    {
      "company": "Strategem Technologies Pte. Ltd.",
      "position": "Business Systems Analyst",
      "startDate": "2006-04-01",
      "endDate": "2008-12-30",
      "summary": "Strategem Technologies Pte. Ltd., headquartered in Singapore, stands as a prominent software development company within the esteemed MANSION group. The MANSION group, known for operating renowned platforms such as www.mansion.com, www.mansion88.com, and www.casino.com, alongside the esteemed Les Ambassadeurs land-based casino in London, boasts a global workforce exceeding 300 employees. With offices strategically located in Singapore, Gibraltar, Spain, and the Philippines, the MANSION group continues to shape the industry landscape with its diverse range of offerings.",
      "highlights": [
        "Authored business requirement specifications used for building a marketing back office tool, the MANSION Promoter Program, encompassing affiliate marketing and player loyalty programs.",
        "Created the vision and business requirement specifications for implementing a prepaid card payment system."
      ]
    },
    {
      "company": "Bayview Technologies Inc",
      "position": "Online Marketing Manager",
      "website": "http://www.bayviewtechnology.com/",
      "startDate": "2005-04-01",
      "endDate": "2006-03-01",
      "summary": "Bayview Technologies Inc. operates as a leading business process outsourcing company, catering to foreign enterprises by delivering a comprehensive suite of services including customer support, back-office operations, and information technology support. Since its establishment in 2002, Bayview has expanded its reach with offices in Hong Kong, Taiwan, and Gibraltar, while establishing a robust regional presence across Asia and Europe.",
      "highlights": [
        "Assisted and led the launch of casinos in the Philippines utilizing Playtech's casino software.",
        "Acted as an account manager for Playtech licensees in Asia"
      ]
    },
    {
      "company": "Anxa",
      "position": "Executive Assistant to the CEO",
      "website": "http://www.anxa.com",
      "startDate": "2001-09-01",
      "endDate": "2005-03-01",
      "highlights": [
        "Worked with the CEO and was deeply involved in the launching of Anxa in Australia, USA and China.",
        "Heavily involved in the recruitment of 30+ staff for various positions ranging from web designers, marketing specialists, business development manager, IT managers and HRD manager."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of South Australia",
      "area": "Busines Administration",
      "studyType": "Masters",
      "startDate": "2009-01-01"
    },
    {
      "institution": "University of the Philippines Los Banos",
      "area": "Communication Arts",
      "studyType": "Undergraduate",
      "startDate": "1997-01-01",
      "endDate": "2000-01-01"
    }
  ],
  "skills": [
    {
      "name": "requirements gathering and authoring",
      "level": "high",
      "keywords": []
    },
    {
      "name": "impact analysis",
      "level": "high",
      "keywords": []
    },
    {
      "name": "agile methodologies",
      "level": "high",
      "keywords": []
    },
    {
      "name": "cross team leadership and collaboration",
      "level": "high",
      "keywords": []
    }
  ],
  "languages": [
    {
      "language": "Filipino",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Intermediate"
    }
  ],
  "references": [
    {
      "name": "Rasmus Rasmusson, VP of Marketing",
      "reference": "Rose was a very well liked project manager, with great attention to detail, and a lot of energy. She does boost morale and also a good deal of knowledge. She is also very good at communication, especially important in the distributed organization that EF is, with offices all over the world."
    },
    {
      "name": "Brian McKay, VP of Product Development",
      "reference": "Rose played a critical role in a major product roll out for EF. During this time she worked across teams, identified risks, solved a range of challenges to deliver a flawless release of a very complex project that had a direct impact on the business. Rose provided leadership and inspiration to the team, helping everyone to step up and deliver beyond expectations. I have only the highest praise for the work she has done as a project manager and leader."
    },
    {
      "name": "Tristan Guo, Technical Lead",
      "reference": "Rose is the best Technical Project Manager I have ever worked with. It was especially impressive when we were working on The New Content Rollout project. The project in my mind is the most complicated one I have ever done on EF Labs, the requirement were so complicated and so many uncertain points when we started. While Rose has got a very good insight of all the potential risks in the very beginning, She helped to clarify every grey areas with both product owners and technical leads, and made everything clear enough for development. Documents were well written, coordinates were well communicated, and issues were well tracked. And finally, under big pressure, we managed to delivered the project ahead of time.  Rose is smart, and optimistic, she is a person that can influence every people around in a positive way to a positive direction, it is a lot of fun working with her, no matter how hard the things we are working on."
    },
    {
      "name": "Raul Costa, Product and CRM Manager",
      "reference": "Rose is one of those persons that you can always feel safe if is involved in your project. Her highly professional point of view allows her to achieve success in whatever she may be working with. She will always keep you posted, focusing on finishing the task with high performance, and if things get really hard she can make it up with a smile upon her face and totally willing to start it all over again if needed.   She is an \"avatar\" for positivity, and if you need to find a softer (but still pretty effective) way to achieve a common goal, you should involve Rose. Our company has many good people, but Rose is one of the memorable ones. Everyone that works with me (in Brazil's office) share the same feelings, although we live oceans away from her."
    }
  ]
}